Autodesk.Revit.DB.ModelEllipse
Represents a ModelEllipse within Autodesk Revit.
Remarks: Currently it's just a place holder for specific type.
All the geometry-related functionality is provided by geometry curve object from
ModelCurve::geometryCurve property.